tutorials/incompressible/pimpleDyMFoam/wingMotion/wingMotion2D_simpleFoam/0/include/frontBackTopBottomPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

topAndBottom
{
    type slip;
}

front
{
    type empty
}

back
{
    type empty;
}

// ************************************************************************* //
